# PhyMaterialParamStructuralThermalTreated Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamStructuralThermalTreated Property
ParameterTypeId Class See Also
---
"Thermally Treated"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamStructuralThermalTreated { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamStructuralThermalTreated As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamStructuralThermalTreated {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace